benchmark_results/01_nginx_static.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        nginx/1.28.0
Server Hostname:        localhost
Server Port:            80

Document Path:          /static/sample.html
Document Length:        153 bytes

Concurrency Level:      10
Time taken for tests:   0.043 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      303000 bytes
HTML transferred:       153000 bytes
Requests per second:    23235.82 [#/sec] (mean)
Time per request:       0.430 [ms] (mean)
Time per request:       0.043 [ms] (mean, across all concurrent requests)
Transfer rate:          6875.44 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:     0    0   0.2      0       1
Waiting:        0    0   0.2      0       1
Total:          0    0   0.2      0       1

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      1
  80%      1
  90%      1
  95%      1
  98%      1
  99%      1
 100%      1 (longest request)