benchmark_results/04_nginx_proxy_dynamic.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        nginx/1.28.0
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        26913 bytes

Concurrency Level:      10
Time taken for tests:   24.808 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      27394000 bytes
HTML transferred:       26913000 bytes
Requests per second:    40.31 [#/sec] (mean)
Time per request:       248.079 [ms] (mean)
Time per request:       24.808 [ms] (mean, across all concurrent requests)
Transfer rate:          1078.37 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       3
Processing:    33  243  98.2    229     652
Waiting:       33  243  98.2    229     652
Total:         33  243  98.3    229     653

Percentage of the requests served within a certain time (ms)
  50%    229
  66%    246
  75%    261
  80%    268
  90%    346
  95%    481
  98%    588
  99%    614
 100%    653 (longest request)