benchmark_results/04_nginx_proxy_dynamic.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        nginx/1.28.0
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        25650 bytes

Concurrency Level:      10
Time taken for tests:   188.772 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      26131000 bytes
HTML transferred:       25650000 bytes
Requests per second:    5.30 [#/sec] (mean)
Time per request:       1887.716 [ms] (mean)
Time per request:       188.772 [ms] (mean, across all concurrent requests)
Transfer rate:          135.18 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:   256 1876 226.0   1927    2551
Waiting:      256 1876 226.0   1927    2551
Total:        256 1876 226.0   1927    2551

Percentage of the requests served within a certain time (ms)
  50%   1927
  66%   1935
  75%   1942
  80%   1950
  90%   2057
  95%   2195
  98%   2270
  99%   2383
 100%   2551 (longest request)