benchmark_results/05_nginx_proxy_cache.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        nginx/1.28.0
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        26913 bytes

Concurrency Level:      10
Time taken for tests:   29.930 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      27394000 bytes
HTML transferred:       26913000 bytes
Requests per second:    33.41 [#/sec] (mean)
Time per request:       299.296 [ms] (mean)
Time per request:       29.930 [ms] (mean, across all concurrent requests)
Transfer rate:          893.83 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       4
Processing:    57  297 103.5    246     885
Waiting:       56  297 103.4    246     885
Total:         57  297 103.5    246     885

Percentage of the requests served within a certain time (ms)
  50%    246
  66%    298
  75%    320
  80%    336
  90%    472
  95%    541
  98%    586
  99%    614
 100%    885 (longest request)